{
  "asg_name": {
    "default": "",
    "description": "Creates a unique name for autoscaling group beginning with the specified prefix",
    "type": "string"
  },
  "associate_public_ip_address": {
    "default": false,
    "description": "Associate a public ip address with an instance in a VPC",
    "type": "bool"
  },
  "create_asg": {
    "default": true,
    "description": "Whether to create autoscaling group",
    "type": "bool"
  },
  "create_asg_with_initial_lifecycle_hook": {
    "default": false,
    "description": "Create an ASG with initial lifecycle hook",
    "type": "bool"
  },
  "create_lc": {
    "default": true,
    "description": "Whether to create launch configuration",
    "type": "bool"
  },
  "default_cooldown": {
    "default": 300,
    "description": "The amount of time, in seconds, after a scaling activity completes before another scaling activity can start",
    "type": "number"
  },
  "desired_capacity": {
    "description": "The number of Amazon EC2 instances that should be running in the group",
    "type": "string"
  },
  "ebs_block_device": {
    "default": [],
    "description": "Additional EBS block devices to attach to the instance",
    "type": "list(map(string))"
  },
  "ebs_optimized": {
    "default": false,
    "description": "If true, the launched EC2 instance will be EBS-optimized",
    "type": "bool"
  },
  "enable_monitoring": {
    "default": true,
    "description": "Enables/disables detailed monitoring. This is enabled by default.",
    "type": "bool"
  },
  "enabled_metrics": {
    "default": [
      "GroupMinSize",
      "GroupMaxSize",
      "GroupDesiredCapacity",
      "GroupInServiceInstances",
      "GroupPendingInstances",
      "GroupStandbyInstances",
      "GroupTerminatingInstances",
      "GroupTotalInstances"
    ],
    "description": "A list of metrics to collect. The allowed values are GroupMinSize, GroupMaxSize, GroupDesiredCapacity, GroupInServiceInstances, GroupPendingInstances, GroupStandbyInstances, GroupTerminatingInstances, GroupTotalInstances",
    "type": "list(string)"
  },
  "ephemeral_block_device": {
    "default": [],
    "description": "Customize Ephemeral (also known as 'Instance Store') volumes on the instance",
    "type": "list(map(string))"
  },
  "force_delete": {
    "default": false,
    "description": "Allows deleting the autoscaling group without waiting for all instances in the pool to terminate. You can force an autoscaling group to delete even if it's in the process of scaling a resource. Normally, Terraform drains all the instances before deleting the group. This bypasses that behavior and potentially leaves resources dangling",
    "type": "bool"
  },
  "health_check_grace_period": {
    "default": 300,
    "description": "Time (in seconds) after instance comes into service before checking health",
    "type": "number"
  },
  "health_check_type": {
    "description": "Controls how health checking is done. Values are - EC2 and ELB",
    "type": "string"
  },
  "iam_instance_profile": {
    "default": "",
    "description": "The IAM instance profile to associate with launched instances",
    "type": "string"
  },
  "image_id": {
    "default": "",
    "description": "The EC2 image ID to launch",
    "type": "string"
  },
  "initial_lifecycle_hook_default_result": {
    "default": "ABANDON",
    "description": "Defines the action the Auto Scaling group should take when the lifecycle hook timeout elapses or if an unexpected failure occurs. The value for this parameter can be either CONTINUE or ABANDON",
    "type": "string"
  },
  "initial_lifecycle_hook_heartbeat_timeout": {
    "default": "60",
    "description": "Defines the amount of time, in seconds, that can elapse before the lifecycle hook times out. When the lifecycle hook times out, Auto Scaling performs the action defined in the DefaultResult parameter",
    "type": "string"
  },
  "initial_lifecycle_hook_lifecycle_transition": {
    "default": "",
    "description": "The instance state to which you want to attach the initial lifecycle hook",
    "type": "string"
  },
  "initial_lifecycle_hook_name": {
    "default": "",
    "description": "The name of initial lifecycle hook",
    "type": "string"
  },
  "initial_lifecycle_hook_notification_metadata": {
    "default": "",
    "description": "Contains additional information that you want to include any time Auto Scaling sends a message to the notification target",
    "type": "string"
  },
  "initial_lifecycle_hook_notification_target_arn": {
    "default": "",
    "description": "The ARN of the notification target that Auto Scaling will use to notify you when an instance is in the transition state for the lifecycle hook. This ARN target can be either an SQS queue or an SNS topic",
    "type": "string"
  },
  "initial_lifecycle_hook_role_arn": {
    "default": "",
    "description": "The ARN of the IAM role that allows the Auto Scaling group to publish to the specified notification target",
    "type": "string"
  },
  "instance_type": {
    "default": "",
    "description": "The size of instance to launch",
    "type": "string",
    "cloudcraft_name": "instanceType"
  },
  "key_name": {
    "default": "",
    "description": "The key name that should be used for the instance",
    "type": "string"
  },
  "launch_configuration": {
    "default": "",
    "description": "The name of the launch configuration to use (if it is created outside of this module)",
    "type": "string"
  },
  "lc_name": {
    "default": "",
    "description": "Creates a unique name for launch configuration beginning with the specified prefix",
    "type": "string"
  },
  "load_balancers": {
    "default": [],
    "description": "A list of elastic load balancer names to add to the autoscaling group names",
    "type": "list(string)"
  },
  "max_size": {
    "description": "The maximum size of the auto scale group",
    "type": "string"
  },
  "metrics_granularity": {
    "default": "1Minute",
    "description": "The granularity to associate with the metrics to collect. The only valid value is 1Minute",
    "type": "string"
  },
  "min_elb_capacity": {
    "default": 0,
    "description": "Setting this causes Terraform to wait for this number of instances to show up healthy in the ELB only on creation. Updates will not wait on ELB instance number changes",
    "type": "number"
  },
  "min_size": {
    "description": "The minimum size of the auto scale group",
    "type": "string"
  },
  "name": {
    "description": "Creates a unique name beginning with the specified prefix",
    "type": "string"
  },
  "placement_group": {
    "default": "",
    "description": "The name of the placement group into which you'll launch your instances, if any",
    "type": "string"
  },
  "placement_tenancy": {
    "default": "default",
    "description": "The tenancy of the instance. Valid values are 'default' or 'dedicated'",
    "type": "string"
  },
  "protect_from_scale_in": {
    "default": false,
    "description": "Allows setting instance protection. The autoscaling group will not select instances with this setting for termination during scale in events.",
    "type": "bool"
  },
  "recreate_asg_when_lc_changes": {
    "default": false,
    "description": "Whether to recreate an autoscaling group when launch configuration changes",
    "type": "bool"
  },
  "root_block_device": {
    "default": [],
    "description": "Customize details about the root block device of the instance",
    "type": "list(map(string))"
  },
  "security_groups": {
    "default": [],
    "description": "A list of security group IDs to assign to the launch configuration",
    "type": "list(string)"
  },
  "service_linked_role_arn": {
    "default": "",
    "description": "The ARN of the service-linked role that the ASG will use to call other AWS services.",
    "type": "string"
  },
  "spot_price": {
    "default": "",
    "description": "The price to use for reserving spot instances",
    "type": "string"
  },
  "suspended_processes": {
    "default": [],
    "description": "A list of processes to suspend for the AutoScaling Group. The allowed values are Launch, Terminate, HealthCheck, ReplaceUnhealthy, AZRebalance, AlarmNotification, ScheduledActions, AddToLoadBalancer. Note that if you suspend either the Launch or Terminate process types, it can prevent your autoscaling group from functioning properly.",
    "type": "list(string)"
  },
  "tags": {
    "default": [],
    "description": "A list of tag blocks. Each element should have keys named key, value, and propagate_at_launch.",
    "type": "list(map(string))"
  },
  "tags_as_map": {
    "default": {},
    "description": "A map of tags and values in the same format as other resources accept. This will be converted into the non-standard format that the aws_autoscaling_group requires.",
    "type": "map(string)"
  },
  "target_group_arns": {
    "default": [],
    "description": "A list of aws_alb_target_group ARNs, for use with Application Load Balancing",
    "type": "list(string)",
    "cloudcraft_name": "target_group_arns"
  },
  "termination_policies": {
    "default": [
      "Default"
    ],
    "description": "A list of policies to decide how the instances in the auto scale group should be terminated. The allowed values are OldestInstance, NewestInstance, OldestLaunchConfiguration, ClosestToNextInstanceHour, Default",
    "type": "list(string)"
  },
  "user_data": {
    "default": " ",
    "description": "The user data to provide when launching the instance",
    "type": "string"
  },
  "vpc_zone_identifier": {
    "description": "A list of subnet IDs to launch resources in",
    "type": "list(string)"
  },
  "wait_for_capacity_timeout": {
    "default": "10m",
    "description": "A maximum duration that Terraform should wait for ASG instances to be healthy before timing out. (See also Waiting for Capacity below.) Setting this to '0' causes Terraform to skip all Capacity Waiting behavior.",
    "type": "string"
  },
  "wait_for_elb_capacity": {
    "default": "null",
    "description": "Setting this will cause Terraform to wait for exactly this number of healthy instances in all attached load balancers on both create and update operations. Takes precedence over min_elb_capacity behavior.",
    "type": "number"
  }
}
